{
  "index": {
    "startTime": "10/24/2024, 11:03:55 AM",
    "stackOverflow": {
      "found": {
        "issues": [
          {
            "System.Title": "Unable to tag or add the response message as a part of the conversation thread from the bot to the request from the user in skype",
            "System.Description": "I have successfully created my chatbot using Microsoft Bot Framework SDK v4 and tested it successfully on the bot emulator and deployed it on azure(Azure Bot).\n\nNow I want to test it without the bot emulator is it possible? And another question does somebody know how can I connect my bot with the WhatsApp using Twilio (I have also the service url for the bot(the azure service) Your help is much appreciated P.S: I am using the JS version for developing the bot",
            "Custom.IssueID": 78853530,
            "Custom.IssueType": "Stack Overflow",
            "Custom.IssueURL": "<a href=\"https://stackoverflow.com/questions/78853530\"> https://stackoverflow.com/questions/78853530 </a>"
          },
          {
            "System.Title": "Issues with Action.Execute in Adaptive Card for Outlook: Not Hitting Endpoint",
            "System.Description": "I'm trying to create an interactive Adaptive Card that I can send as JSON to Outlook. My goal is for users to press buttons on the card that will trigger requests to my API. Ideally, I'd like to provide feedback directly on the card, such as changing the button text or disabling it after submission.\n\nI understand that I can use Action.Http, but I’m limited to version 1.1, which lacks some of the functionality I need. I've seen that Action.Execute is supposed to be a more advanced replacement for Action.Http, but I’m having trouble getting it to work.\n\nThe Issue:\n\n * Action.Execute Behavior: When I click the submit button on the card, nothing happens. Instead, I receive an error message saying, \"The action could not be completed.\"\n * Provider Registration: I have registered the provider and included my organization's originator ID in the Adaptive Card. I’ve also set the target URL using a regex pattern like https://.+\\.exampleapi\\.com/email_actions/.+, but nothing seems to be hitting my endpoint.\n * Fallback Attempt: I also tried using version 1.4 with Action.Execute and added a fallback to Action.Http, but that didn’t resolve the issue either.\n\nWhat I’ve Observed:\n\n * Browser Network Request: When I click the button, I notice that Outlook makes an internal request to https://outlook.office.com/actionsb2netcore/userid/messages/... [https://outlook.office.com/actionsb2netcore/userid/messages/...], but this request doesn't seem to reach my specified endpoint. The request looks something like this:\n\nJSON:\n\n{\n  \"type\":\"invoke\",\n  \"name\":\"adaptiveCard/action\",\n  \"localTimezone\":\"\",\n  \"localTimestamp\":\"\",\n  \"value\":{\n    \"action\":{\n      \"type\":\"Action.Execute\",\n      \"verb\":\"feedbackSubmission\",\n      \"data\":{\n        \"feedback\":\"some feedback\"\n      }\n    },\n    \"trigger\":\"manual\"\n  },\n  \"from\":{\n    \"id\":\"user@example.com\"\n  },\n  \"channelData\":{\n    \"connectorSenderGuid\":\"some-guid\",\n    \"adaptiveCardSignature\":\"some-signature\"\n  }\n}\n\n\nQuestions:\n\n 1. Scope of Submission: Do I need to submit my provider under the \"Testing\" scope for test users, or should I use the \"Organization\" scope? Could this be affecting why my actions aren't triggering any API requests?\n\n 2. Understanding the Request Flow: Can someone explain what happens when the button is clicked in the context of Outlook? It seems like the action is being intercepted internally by Outlook but isn't reaching my backend.\n\n 3. Is there anything specific I should be doing to make Action.Execute work properly in Outlook? Any insights would be greatly appreciated.\n\n 4. Do I Need an Azure Bot? Do Adaptive Cards in Outlook need to be processed by an Azure Bot to handle user interactions? My goal is to send an email with an Adaptive Card to a user and process the user's actions on the backend by sending some requests. I have a feeling this might require an Azure Bot, but I’m unsure how to trigger the bot to send the Adaptive Card to the user, especially if the user didn't start a conversation or perform any other action first.",
            "Custom.IssueID": 78893407,
            "Custom.IssueType": "Stack Overflow",
            "Custom.IssueURL": "<a href=\"https://stackoverflow.com/questions/78893407\"> https://stackoverflow.com/questions/78893407 </a>"
          }
        ],
        "count": 2
      },
      "devOps": [
        {
          "id": 82465,
          "Custom.IssueID": 78853530,
          "System.Title": "Unable to tag the response message from the bot to the request from the user in skype"
        },
        {
          "id": 82565,
          "Custom.IssueID": 78893407,
          "System.Title": "Issues with Action.Execute in Adaptive Card for Outlook: Not Hitting Endpoint"
        }
      ],
      "newIssues": {
        "issues": [],
        "count": 0
      }
    },
    "internalStackOverflow": {
      "found": {
        "issues": [],
        "count": 0
      },
      "devOps": [],
      "newIssues": {
        "issues": [],
        "count": 0
      }
    },
    "github": {
      "found": {
        "issues": [
          {
            "System.Title": "TeamsInfo.SendMessageToTeamsChannelAsync relies on old adapter",
            "System.Tags": "",
            "Custom.IssueID": 6842,
            "Custom.IssueType": "GitHub",
            "Custom.SDK": "C#",
            "Custom.Repository": "botbuilder-dotnet",
            "Custom.IssueURL": "<a href=\"https://github.com/microsoft/botbuilder-dotnet/issues/6842\"> https://github.com/microsoft/botbuilder-dotnet/issues/6842</a>",
            "System.Description": ""
          }
        ],
        "count": 1
      },
      "devOps": [
        {
          "id": 59145,
          "Custom.IssueID": 6842,
          "System.Title": "During provision, adjust the app insights publishing profile data to include the connection string"
        },
        {
          "id": 82609,
          "Custom.IssueID": 6842,
          "System.Title": "TeamsInfo.SendMessageToTeamsChannelAsync relies on old adapter"
        }
      ],
      "newIssues": {
        "issues": [],
        "count": 0
      }
    },
    "endTime": "10/24/2024, 11:04:16 AM"
  }
}